app/controllers/groups_controller.rb

  def create
      @group = Group.new(group_params)
      @group.save
---
INSERT INTO "groups" ("name", "mentor", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "group"], ["mentor", "r"], ["date", "3/22"], ["time", "5"], ["created_at", "2021-06-22 19:33:11.431257"], ["updated_at", "2021-06-22 19:33:11.431257"]]