app/controllers/tasks_controller.rb

    def index
        @tasks = Task.all.order("created_at DESC")
---
SELECT "tasks".* FROM "tasks" ORDER BY created_at DESC

    def create
        @task = Task.new(task_params)
        @task.save
---
INSERT INTO "tasks" ("title", "date", "time", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)